# -- coding: utf-8 -- 

# 创建 删除数字对象

a = 1   # 创建数字对象,用a指向存放这个对象的盒子
b = 2
a = b  # 数字对象是不可变的,所以这里a是指向了别的盒子.原来盒子内容并没有改变

del a   # 删除变量

# 整型和长整型的统一,当整型的数值 > 2**31 - 1 or < - 2**31  自动转化成长整型


# 双精度浮点数
	#	example	-777.   float(12)  3.1416   6.022e23

# 复数
	# example  1.23e-045+6.7e+089j 6.23+1.5j  0+1j  -.0224+0j
	''' 1.虚数不能单独存在,必须要有实数
		2.实数部分和虚数部分都是浮点数
		3.虚数的语法: real+imagj,
	'''
	# 属性 num.real    num.imag   num.conjugate() 共轭复数

# 算术运算符优先级 ＋(正) －(负) **(指数)   * /  //  %  + -

# 位运算符优先级  ~,&,|,^,<<,>>


# 类型转换的函数 coerce(num1, num2) 将两者转换为同类型,元组返回

# 进制转换函数  hex() 返回16进制字符串   oct()返回8进制字符串

# ASCII 转换函数  # ord('字符') 返回ASCII表的位置  
				# chr('位置')  将ASCII值的数字转换成ASCII字符,范围只能是0 <= num <= 255
				
# unichr(num) Unicode(num),返回对应字符


# Decimal 类  详见usedecimal.py